In [1]:
import pandas as pd

In [3]:
# Read CSV

read_CSV = pd.read_csv("E:\\CODE\\JUPYTER\\datasheet.csv")
read_CSV

    Name  Age    Language
0    Raj   20      Python
1  Alice   19        Java
2    Sky   21           C
3  Shawn   25  Javascript

In [4]:
# Filter Rows

read_CSV = pd.read_csv("E:\\CODE\\JUPYTER\\datasheet.csv",nrows=1)
read_CSV

  Name  Age Language
0  Raj   20   Python

In [7]:
# Filter Column

read_CSV = pd.read_csv("E:\\CODE\\JUPYTER\\datasheet.csv",usecols=[0])
read_CSV

    Name
0    Raj
1  Alice
2    Sky
3  Shawn

In [8]:
# Filter Both

read_CSV = pd.read_csv("E:\\CODE\\JUPYTER\\datasheet.csv",usecols=[0],nrows=1)
read_CSV

  Name
0  Raj

In [10]:
# Skip and set Row

read_CSV = pd.read_csv("E:\\CODE\\JUPYTER\\datasheet.csv",skiprows=1)
read_CSV

     Raj  20      Python
0  Alice  19        Java
1    Sky  21           C
2  Shawn  25  Javascript

In [14]:
# Skip and set Col

read_CSV = pd.read_csv("E:\\CODE\\JUPYTER\\datasheet.csv",index_col=0)
read_CSV

       Age    Language
Name
Raj     20      Python
Alice   19        Java
Sky     21           C
Shawn   25  Javascript